In [1]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index_s=['a','b','c','d','e']
ser=pd.Series([1,2,3,4,5],index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
ser[0]
#ser[a]

C:\Users\Admin\AppData\Local\Temp\ipykernel_8308\1314631141.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0]

np.int64(1)

In [12]:
dict_data={'a':1,'b':2,'c':3,'d':4}
s3=pd.Series(dict_data)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울','부산']])

9776
서울    9776
부산    2729
dtype: int64

In [16]:
population.info()    #4개의 인덱스 ,최소는 서울 최대는 대구

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [20]:

ser.iloc[0],ser.loc['a']         #숫자인덱스, 인덱스를 가지고 꺼냄

(np.int64(1), np.int64(1))

# 데이터 프레임

In [21]:
#pd.DataFrame(data,index=[행이름들],columns=[열이름들])

In [24]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [26]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [28]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [30]:
scientists.index=['  Rosaline Franklin',' William Gosset']
scientists.index

Index(['  Rosaline Franklin', ' William Gosset'], dtype='object')

In [32]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [34]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name:  William Gosset, dtype: object

In [48]:
scientists.loc["Rosaline Franklin"]

Occupation       Chemist
Born          1920-07-25
Died          1958-04-16
Age                   37
Name: Rosaline Franklin, dtype: object

In [51]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object', name='Name')

In [43]:
data=[[1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]]

df=pd.DataFrame(data)
print(df)

#열 이름 지정하여 생성
df=pd.DataFrame(data,columns=['A','B','C'])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
import numpy as np
import pandas as pd

arr=np.array([[1,2,3],
             [4,5,6],
             [7,8,9]])

df=pd.DataFrame(arr,columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [53]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [55]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [58]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [61]:
sci1["Occupation"]

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [63]:
sci1.to_csv('./data/scientist_1.csv')

In [67]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [75]:
#pickle(파이썬의 객체형을 저장)
sci1.to_pickle('./data/scientist.pickle')

In [76]:
df2=pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [69]:
df=pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [73]:
df1=pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.head()   #기본5개

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [80]:
df1.tail()

            Name        Born        Died  Age          Occupation
3    Marie Curie  1867-11-07  1934-07-04   66             Chemist
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df1.describe()   #기술통계

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [84]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

# 행과 열 이름 바꾸기

In [ ]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

#행 이름 출력 
#print(df.index)

#열 이름 출력
#print(df.columns)

In [111]:
#행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [112]:
df.columns=['name','age','score']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [119]:
  #열이름 변경
df=df.rename(index={"A":"a", "B":"b"})
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [ ]:
#data/gapminder.tsv 를 읽어 데이터 프레임 만들기

df=pd.read_csv('./data/gapminder.tsv',sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [ ]:
#country열 추출하기

df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [123]:
#'country','continent','year' 열 추출하기

In [125]:
#[0],[99],[-1]행을 각각 추출하기